app/controllers/subscribers_controller.rb

INSERT INTO "subscribers" ("name", "email", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Test"], ["email", "Test"], ["notes", "Test"], ["created_at", "2015-11-29 19:38:16.859999"], ["updated_at", "2015-11-29 19:38:16.859999"]]
---
  def create
    @subscriber = Subscriber.new(subscriber_params)

    respond_to do |format|
      if @subscriber.save

SELECT  "subscribers".* FROM "subscribers" WHERE "subscribers"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_subscriber
      @subscriber = Subscriber.find(params[:id])